Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: the first exit passage orifice (134A) is circumferentially between the first feed passage (100A) orifice and the first end (116) of the gallery (98).
de_de: die erste Auslassdurchgangsmündung (134A) in Umfangsrichtung zwischen der Mündung des ersten Zufuhrdurchgangs (100A) und dem ersten Ende (116) des Kanals (98) ist.

source: 7. The fuel injector (64) of any preceding claim, wherein
de_de: 7. Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei:

source: the size of the gallery (98) decreases as the gallery (98) extends in a first direction circumferentially around the axis (106) from an intermediate location (154) towards the first end (116) of the gallery (98); and
de_de: sich die Größe des Kanals (98) verringert, während sich der Kanal (98) in einer ersten Richtung in Umfangsrichtung um die Achse (106) von einer mittleren Position (154) in Richtung des ersten Endes (116) des Kanals (98) erstreckt; und

source: the size of the gallery (98) decreases as the gallery (98) extends in a second direction circumferentially around the axis (106) from the intermediate location (154) towards the second end (118) of the gallery (98).
de_de: sich die Größe des Kanals (98) verringert, während sich der Kanal (98) in einer zweiten Richtung in Umfangsrichtung um die Achse (106) von der mittleren Position (154) in Richtung des zweiten Endes (118) des Kanals (98) erstreckt.

source: 8. The fuel injector (64) of any preceding claim, wherein the gallery (98) extends less than 180° circumferentially around the axis (106) from the first end (116) of the gallery (98) to the second end (118) of the gallery (98).
de_de: 8. Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei sich der Kanal (98) weniger als 180° in Umfangsrichtung um die Achse (106) von dem ersten Ende (116) des Kanals (98) zu dem zweiten Ende (118) des Kanals (98) erstreckt.

source: 9. The fuel injector (64) of any of claims 1 to 7, wherein the gallery (98) extends more than 270° and less than 360° circumferentially around the axis (106) from the first end (116) of the gallery (98) to the second end (118) of the gallery (98).
de_de: 9. Einspritzdüse (64) nach einem der Ansprüche 1 bis 7, wobei sich der Kanal (98) mehr als 270° und weniger als 360° in Umfangsrichtung um die Achse (106) von dem ersten Ende (116) des Kanals (98) zu dem zweiten Ende (118) des Kanals (98) erstreckt.

source: The fuel injector (64) of any preceding claim, wherein a or the first (102A) of the plurality of exit passages (102) extends along a centerline (144A) that is non-parallel with the axis (106).
de_de: Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei sich ein oder der erste (102A) der Vielzahl von Auslassdurchgängen (102) entlang einer Mittellinie (144A), die nicht parallel zu der Achse (106) ist, erstreckt.

source: 1. An air data probe (10) comprising:
de_de: 1. Luftdatensonde (10), umfassend:

source: a probe head (12);
de_de: einen Sondenkopf (12);

source: a strut (14) connected to the probe head (12);
de_de: eine Strebe (14), die mit dem Sondenkopf (12) verbunden ist;

source: a mounting flange (16) connected to the strut;
de_de: einen Montageflansch (16), der mit der Strebe verbundenen ist;

source: a transducer (18) connected to the mounting flange;
de_de: einen Wandler (18), der mit dem Montageflansch verbunden ist;

source: a heater (20) extending within the probe head (12) and the strut (14); and
de_de: eine Heizung (20), die sich innerhalb des Sondenkopfes (12) und der Strebe (14) erstreckt; und

source: a connector (22) connected to the strut (14) and positioned within the transducer, the connector comprising:
de_de: einen Verbinder (22), der mit der Strebe (14) verbunden und innerhalb des Wandlers positioniert ist, der Verbinder umfassend:

source: a shell (24);
de_de: ein Gehäuse (24);

source: an insert (26) that fits within and is positioned inside the shell (24), the insert having a first and a second openings (30A, 30B) that each extend from a first end of the insert to a second end of the insert, wherein the insert is made of ceramic; and
de_de: einen Einsatz (26), der in das Gehäuse (24) passt und darin positioniert ist, wobei der Einsatz eine erste und eine zweite Öffnung (30A, 30B) aufweist, die sich jeweils von einem ersten Ende des Einsatzes zu einem zweiten Ende des Einsatzes erstrecken, wobei der Einsatz aus Keramik hergestellt ist; und

source: a first socket (28A) that extends within the first opening (30A) of the insert (26) from the first end of the insert to the second end of the insert, the first socket (28A) comprising:
de_de: eine erste Buchse (28A), die sich innerhalb der ersten Öffnung (30A) des Einsatzes (26) von dem ersten Ende des Einsatzes zu dem zweiten Ende des Einsatzes erstreckt, die erste Buchse (28A) umfassend:

source: a first hood (32A) making up an exterior of the first socket;
de_de: eine erste Haube (32A), die eine Außenseite der ersten Buchse bildet;

source: a first body (34A) within the first hood (32A);
de_de: einen ersten Körper (34A) innerhalb der ersten Haube (32A);

source: a first annular tine (36A) extending from the first body (34A) within the first hood (32A);
de_de: eine erste ringförmige Zinke (36A), die sich von dem ersten Körper (34A) innerhalb der ersten Haube (32A) erstreckt;

source: a first annular lip (38A) extending around an exterior of the first tine (36A) adjacent an end of the first tine such that the first annular lip is between the first annular tine and the first hood; and
de_de: eine erste ringförmige Lippe (38A), die sich, einem Ende der ersten Zinke benachbart, derart um eine Außenseite der ersten Zinke (36A) erstreckt, dass die erste ringförmige Lippe zwischen der ersten ringförmigen Zinke und der ersten Haube ist; und

source: a first cavity (40A) formed within the first tine (36A) and shaped to accept a first pin connected to the heater; and
de_de: einen ersten Hohlraum (40A), der innerhalb der ersten Zinke (36A) ausgebildet und geformt ist, um einen ersten Stift aufzunehmen, der mit der Heizung verbunden ist; und

source: a second socket (28B) that extends within the second opening (30B) of the insert (26) from the first end of the insert to the second end of the insert, the second socket (28B) comprising:
de_de: eine zweite Buchse (28B), die sich innerhalb der zweiten Öffnung (30B) des Einsatzes (26) von dem ersten Ende des Einsatzes zu dem zweiten Ende des Einsatzes erstreckt, die zweite Buchse (28B) umfassend:

source: a second hood (32B) making up an exterior of the second socket;
de_de: eine zweite Haube (32B), die eine Außenseite der zweiten Buchse bildet;

source: a second body (34B) within the second hood (32B);
de_de: einen zweiten Körper (34B) innerhalb der zweiten Haube (32B);

source: a second annular tine (36B) extending from the second body (34B) within the second hood (32B);
de_de: eine zweite ringförmige Zinke (36B), die sich von dem zweiten Körper (34B) innerhalb der zweiten Haube (32B) erstreckt;

source: a second annular lip (38B) extending around an exterior of the second tine (36B) adjacent an end of the second tine such that the second annular lip is between the second annular tine and the second hood; and
de_de: eine zweite ringförmige Lippe (38B), die sich, einem Ende der zweiten Zinke benachbart, derart um eine Außenseite der zweiten Zinke (36B) erstreckt, dass die zweite ringförmige Lippe zwischen der zweiten ringförmigen Zinke und der zweiten Haube ist; und

source: a second cavity (40B) formed within the second tine (36B) and shaped to accept a second pin connected to the heater.
de_de: einen zweiten Hohlraum (40B), der innerhalb der zweiten Zinke (36B) ausgebildet und geformt ist, um einen zweiten Stift aufzunehmen, der mit der Heizung verbunden ist.

source: 2. The air data probe (10) of claim 1, wherein the connector (22) is configured to position within the air data probe (10), and is sized and shaped to fit within a transducer (18) of an air data probe (10) to electrically connect a heater (20) of the air data probe (10) to current from within the transducer (18).
de_de: 2. Luftdatensonde (10) nach Anspruch 1, wobei der Verbinder (22) konfiguriert ist, um sich innerhalb der Luftdatensonde (10) zu positionieren, und bemessen und geformt ist, um in einen Wandler (18) einer Luftdatensonde (10) zu passen, um eine Heizung (20) der Luftdatensonde (10) elektrisch mit Strom aus dem Inneren des Wandlers (18) zu verbinden.

source: 3. The air data probe (10) of claim 1 or 2, wherein the first socket and the second socket (28A, 28B) are made of Alumel.
de_de: 3. Luftdatensonde (10) nach Anspruch 1 oder 2, wobei die erste Buchse und die zweite Buchse (28A, 28B) aus Alumel hergestellt sind.

source: 4. The air data probe (10) of any preceding claim, wherein the first lip is between the first tine (36A) and an interior surface of the first hood (32A), and the second lip is between the second tine and an interior surface of the second hood.
de_de: 4. Luftdatensonde (10) nach einem der vorhergehenden Ansprüche, wobei die erste Lippe zwischen der ersten Zinke (36A) und einer Innenfläche der ersten Haube (32A) ist und die zweite Lippe zwischen der zweiten Zinke und einer Innenfläche der zweiten Haube ist.

source: 5. The air data probe (10) of any preceding claim, wherein the first lip (38A) and the first tine (36A) are unitary, and the second lip (38B) and the second tine (36B) are unitary.
de_de: 5. Luftdatensonde (10) nach einem der vorhergehenden Ansprüche, wobei die erste Lippe (38A) und die erste Zinke (36A) einstückig sind und die zweite Lippe (38B) und die zweite Zinke (36B) einstückig sind.

source: 1. An assembly including a locking tab washer (70) for rotatably locking a bolt (40) fastened to a component (50, 60) in an aircraft engine, the bolt (40) having a bolt head (41) with repeated flat surfaces (42), the assembly comprising:
de_de: 1. Baugruppe mit einer Sicherungslaschenscheibe (70) zum drehbaren Sichern einer Schraube (40), die an einer Komponente (50, 60) in einem Flugzeugtriebwerk befestigt ist, wobei die Schraube (40) einen Schraubenkopf (41) mit sich wiederholenden ebenen Flächen (42) aufweist, die Baugruppe umfassend:

source: the component (50,60) having a flange (52) having a radially outer surface (53) with scalloped edges (54, 62); and
de_de: die Komponente (50, 60), die einen Flansch (52) mit einer radial äußeren Fläche (53) mit gezackten Kanten (54, 62) aufweist; und

source: the locking tab washer (70) comprising:
de_de: die Sicherungslaschenscheibe (70), umfassend:

source: an opening (73) extending from a front surface (71) of the locking tab washer (70) to a rear surface (72) of the locking tab washer (70), with an axis (A) defined through a center of the opening (73);
de_de: eine Öffnung (73), die sich von einer vorderen Fläche (71) der Sicherungslaschenscheibe (70) zu einer hinteren Fläche (72) der Sicherungslaschenscheibe (70) erstreckt, wobei eine Achse (A) durch einen Mittelpunkt der Öffnung (73) definiert ist;

source: at least four locking tabs (74) positioned about the opening (73) and circumferentially spaced apart from one another at integer multiples of a common angle relative to the center of the opening (73), the at least four locking tabs (74) bendable towards the opening (73) in a first direction (D1) relative to the axis (A) to rotatably lock the bolt (40); and
de_de: mindestens vier Sicherungslaschen (74), die um die Öffnung (73) herum positioniert und in Umfangsrichtung um ganzzahlige Vielfache eines gemeinsamen Winkels relativ zu dem Mittelpunkt der Öffnung (73) voneinander beabstandet sind, wobei die mindestens vier Sicherungslaschen (74) in einer ersten Richtung (D1) relativ zu der Achse (A) in Richtung der Öffnung (73) biegbar sind, um die Schraube (40) drehbar zu sichern; und

source: a retaining feature positioned about the opening (73) and operable to rotatably retain the locking tab washer (70) to the component (50, 60) wherein the retaining feature includes a pair of anti-rotation tabs (75), each anti-rotation tab (75) having a first portion (75a) extending radially outwardly from the opening (73) and a second portion extending in a second direction (D2) relative to the axis (A) opposite the first direction (D1), the anti-rotation tabs (75) engaging the radially-outer surface (53) of the component (50, 60), the anti-rotation tabs (75) abutting against the scalloped edges (54, 62) on the radially-outer surface (53) of the flange (52) of the component (50, 60).
de_de: ein Haltemerkmal, das um die Öffnung (73) herum positioniert ist und dazu dient, um die Sicherungslaschenscheibe (70) drehbar an dem Bauteil (50, 60) zu halten, wobei das Haltemerkmal ein Paar von Verdrehsicherungslaschen (75) beinhaltet, wobei jede Verdrehsicherungslasche (75) einen ersten Abschnitt (75a), der sich von der Öffnung (73) radial nach außen erstreckt, und einen zweiten Abschnitt, der sich in einer zweiten Richtung (D2) relativ zu der Achse (A) gegenüber der ersten Richtung (D1) erstreckt, aufweist, wobei die Verdrehsicherungslaschen (75) in die radial äußere Fläche (53) des Bauteils (50, 60) eingreifen, wobei die Verdrehsicherungslaschen (75) an den gezackten Kanten (54, 62) an der radial äußeren Fläche (53) des Flansches (52) des Bauteils (50, 60) anliegen.

source: 2. The assembly as defined in claim 1, wherein the at least four locking tabs (74) include four locking tabs (74) circumferentially spaced apart from one another at integer multiples of fifteen degrees.
de_de: 2. Baugruppe nach Anspruch 1, wobei die mindestens vier Sicherungslaschen (74) vier Sicherungslaschen (74) beinhalten, die in Umfangsrichtung um ganzzahlige Vielfache von fünfzehn Grad voneinander beabstandet sind.

source: 3. The assembly as defined in claim 2, wherein a first and a second of the four locking tabs (741, 742) are circumferentially spaced apart by ninety degrees, the second and a third of the four locking tabs (742, 743) are circumferentially spaced apart by forty five degrees, and the third and a fourth of the four locking tabs (743, 744) are circumferentially spaced apart by ninety degrees.
de_de: 3. Baugruppe nach Anspruch 2, wobei eine erste und eine zweite der vier Sicherungslaschen (741, 742) in Umfangsrichtung um neunzig Grad voneinander beabstandet sind, die zweite und eine dritte der vier Sicherungslaschen (742, 743) in Umfangsrichtung um fünfundvierzig Grad voneinander beabstandet sind und die dritte und eine vierte der vier Sicherungslaschen (743, 744) in Umfangsrichtung um neunzig Grad voneinander beabstandet sind.

source: 4. The assembly as defined in claim 2, wherein a first and a second of the four locking tabs (741, 742) are circumferentially spaced apart by ninety degrees, the second and a third of the four locking tabs (742, 743) are circumferentially spaced apart by ninety degrees, and the third and a fourth of the four locking tabs (743, 744) are circumferentially spaced apart by ninety degrees.
de_de: 4. Baugruppe nach Anspruch 2, wobei eine erste und eine zweite der vier Sicherungslaschen (741, 742) in Umfangsrichtung um neunzig Grad voneinander beabstandet sind, die zweite und eine dritte der vier Sicherungslaschen (742, 743) in Umfangsrichtung um neunzig Grad voneinander beabstandet sind und die dritte und eine vierte der vier Sicherungslaschen (743, 744) in Umfangsrichtung um neunzig Grad voneinander beabstandet sind.

source: 5. The assembly as defined in any one of claims 1 to 4, wherein the retaining feature further includes at least one foot extending radially outwardly relative to the opening (73) and operable to abut an engagement surface of the component (50, 60) to rotatably retain the locking tab washer (70) to the component (50, 60).
de_de: 5. Baugruppe nach einem der Ansprüche 1 bis 4, wobei das Haltemerkmal ferner mindestens einen Fuß beinhaltet, der sich relativ zu der Öffnung (73) radial nach außen erstreckt und dazu dient, an einer Eingriffsfläche der Komponente (50, 60) anzuliegen, um die Sicherungslaschenscheibe (70) drehbar an der Komponente (50, 60) zu halten.

source: 6. The assembly as defined in any one of claims 1 to 5, wherein the retaining feature further includes a key (78) having a first portion (78a) extending radially outwardly relative to the opening (73) and a second portion (78b) extending in a second direction (D2) relative to the axis (A) opposite the first direction (D1), the key (78) operable to engage a slot in the component (50, 60).
de_de: 6. Baugruppe nach einem der Ansprüche 1 bis 5, wobei das Haltemerkmal ferner einen Keil (78) beinhaltet, der einen ersten Abschnitt (78a) aufweist, der sich relativ zu der Öffnung (73) radial nach außen erstreckt, und einen zweiten Abschnitt (78b), der sich in einer zweiten Richtung (D2) relativ zu der Achse (A) entgegengesetzt zu der ersten Richtung (D1) erstreckt, wobei der Keil (78) in einen Schlitz in der Komponente (50, 60) eingreifen kann.

source: 7. The assembly as defined in any one of claims 1 to 6, further comprising a second opening (73) extending from a front surface (71) of the locking tab washer (70) to a rear surface (72) of the locking tab washer (70), with a second axis (A) defined through a center of the second opening (73), at least four additional locking tabs (74) positioned about the second opening (73) and circumferentially spaced apart from one another at integer multiples of forty five degrees with reference to the center of the second opening (73), the at least four additional locking tabs (74) bendable towards the opening (73) in a first direction (D1) relative to the axis (A) to rotatably lock a second bolt (40) insertable through the opening (73), wherein the retaining feature extends between the opening (73) and the second opening (73).
de_de: 7. Baugruppe nach einem der Ansprüche 1 bis 6, ferner umfassend eine zweite Öffnung (73), die sich von einer vorderen Fläche (71) der Sicherungslaschenscheibe (70) zu einer hinteren Fläche (72) der Sicherungslaschenscheibe (70) erstreckt, mit einer zweiten Achse (A), die durch einen Mittelpunkt der zweiten Öffnung (73) definiert ist, mindestens vier zusätzliche Sicherungslaschen (74), die um die zweite Öffnung (73) herum positioniert sind und in Umfangsrichtung in ganzzahligen Vielfachen von fünfundvierzig Grad in Bezug auf den Mittelpunkt der zweiten Öffnung (73) voneinander beabstandet sind, wobei die mindestens vier zusätzlichen Sicherungslaschen (74) in einer ersten Richtung (D1) relativ zu der Achse (A) in Richtung der Öffnung (73) biegbar sind, um eine zweite Schraube (40), die durch die Öffnung (73) einführbar ist, drehbar zu sichern, wobei sich das Haltemerkmal zwischen der Öffnung (73) und der zweiten Öffnung (73) erstreckt.

source: 8. The assembly as defined in any one of claims 1 to 7, wherein one or more of the at least four locking tabs (74) are pre-bent in the first direction (D1) relative to the axis (A).
de_de: 8. Baugruppe nach einem der Ansprüche 1 bis 7, wobei eine oder mehrere der mindestens vier Verriegelungslaschen (74) in der ersten Richtung (D1) relativ zu der Achse (A) vorgebogen sind.

source: 9. A locking assembly (30) for joining two components (50, 60) in an aircraft engine, comprising:
de_de: 9. Sicherungsbaugruppe (30) zum Verbinden zweier Komponenten (50, 60) in einem Flugzeugtriebwerk, umfassend:

source: an assembly as defined in any one of claims 1 to 8, the rear surface (72) of the locking tab washer (70) disposed against the component (50, 60) with the opening (73) aligned with apertures in the component (50, 60) and a second component (50, 60), and
de_de: eine Baugruppe nach einem der Ansprüche 1 bis 8, wobei die hintere Fläche (72) der Sicherungslaschenscheibe (70) an der Komponente (50, 60) anliegt und die Öffnung (73) an Öffnungen in der Komponente (50, 60) und einer zweiten Komponente (50, 60) ausgerichtet ist, und

source: a bolt (40) having a bolt head (41) with a plurality of flat surfaces (42), and a shank rotatably received through the opening (73) and through the apertures in the two components (50, 60), the bolt (40) torqued to a predetermined degree, each of the plurality of flat surfaces (42) of the bolt (40) having a loaded half surface (42b) and an unloaded half surface (42a) when the bolt (40) is torqued, at least one of the at least four locking tabs (74) bendable towards the bolt head (41) with at least half of its width aligned with a loaded half surface (42b) of a corresponding flat surface (42) to prevent untorqueing of the bolt (40) when the bolt (40) is torqued.
de_de: eine Schraube (40) mit einem Schraubenkopf (41) mit einer Vielzahl von ebenen Flächen (42) und einem Schaft, der drehbar durch die Öffnung (73) und durch die Aussparungen in den zwei Komponenten (50, 60) aufgenommen ist, wobei die Schraube (40) bis zu einem vorbestimmten Grad festgezogen ist, wobei jede der Vielzahl von ebenen Flächen (42) der Schraube (40) eine belastete Flächenhälfte (42b) und eine unbelastete Flächenhälfte (42a) aufweist, wenn die Schraube (40) festgezogen ist, wobei mindestens eine der mindestens vier Sicherungslaschen (74) in Richtung des Schraubenkopfes (41) biegbar ist, wobei mindestens die Hälfte ihrer Breite an einer belasteten Flächenhälfte (42b) einer entsprechenden ebenen Fläche (42) ausgerichtet ist, um ein Lösen der Schraube (40) zu verhindern, wenn die Schraube (40) festgezogen ist.

source: A method for joining two components (50, 60) in an aircraft engine, comprising:
de_de: Verfahren zum Verbinden zweier Komponenten (50, 60) in einem Flugzeugtriebwerk, umfassend:

source: positioning a locking tab washer (70) against a first of the two components (50, 60) with an opening (73) in the locking tab washer (70) aligned with apertures in the first of the two components (50, 60) and in a second of the two components (50, 60);
de_de: Positionieren einer Sicherungslaschenscheibe (70) gegen eine erste der beiden Komponenten (50, 60), wobei eine Öffnung (73) in der Sicherungslaschenscheibe (70) an Aussparungen in der ersten der beiden Komponenten (50, 60) und in der zweiten der beiden Komponenten (50, 60) ausgerichtet ist;

source: inserting a bolt (40) through the opening (73) and through the apertures in the two components (50, 60);
de_de: Einführen einer Schraube (40) durch die Öffnung (73) und durch die Aussparungen in den beiden Komponenten (50, 60);

source: torqueing the bolt (40) to a predetermined degree;
de_de: Festziehen der Schraube (40) bis zu einem vorbestimmten Grad;
